artillery.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 60 # Duração do teste em segundos
      arrivalRate: 1 # Taxa de chegada de requisições por segundo
      rampTo: 4
      name: Aquecimento
    - duration: 60
      arrivalRate: 4
      rampTo: 6
      name: Período quente
    - duration: 30
      arrivalRate: 6
      rampTo: 10
      name: Pico
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100 #o tempo de resposta não deve ultrapassar esse número (em ms)
  ensure:
    thresholds:
      - http.response_time.p99: 100 #Isso diz que 99% das requisições deve ser atendida em 100ms ou menos
      - http.response_time.p95: 75 #Isso diz que 95% das requisições deve ser atendida em 100ms ou menos
  payload:
    path: "./utils/equipamentos_500_linhas.csv"
    fields:
      - "equipmentId"
      - "timestamp"
      - "value"
    order: sequence
    skipHeader: true
    delimiter: ;
    cast: true
    name: sensorReadings

scenarios:
  # - name: "Test GET method"
  #   flow:
  #     - get:
  #         url: "/sensor"

  - name: "Test POST method"
    flow:
      - post:
          url: "/readings"
          json:
            equipmentId: "{{ equipmentId }}"
            timestamp: "{{ timestamp }}"
            value: "{{ value }}"
          headers:
            Content-Type: "application/json"